#!/usr/bin/python
#-*- coding:UTF-8 -*-
#########################################################################
# File Name: text_recog.py
# Author: Junyi Li
# Mail: ljyduke@gmail.com
# Created Time: 15:13:08 2018-05-02
#########################################################################
# -*- coding: utf-8 -*-
import sys
import io
import codecs
import jieba
import subprocess
import os
import re
# from wmd_util import WmdUtil


sys.stdout = io.TextIOWrapper(sys.stdout.buffer,encoding='utf-8')

# print('哈哈哈')

menu = {}
f = codecs.open('../data/menu_hack_final.txt','r','utf-8')
for line in f:
    line = line.strip().split('\t')
    menu[line[0]] = line[:]

def word_seg(inputData):
    '''
    简单描述一下jieba分词。
    '''
    stopWords = open("../data/中文停用词.txt").read().split("\n") # 加载停用词，网上一把一把
    main_m = open("../data/main_material.txt").read().split(",")
    # for i in stopWords:
    #     print(i)
    #     break
    results=[] # 存放结果
    wordlist = []
    Data = inputData
    Data = "".join(re.findall(u'[\u4e00-\u9fa5]+', Data)) # 首先将数据中所有的中文提取出来
    if Data == '':
        return "0"
    for i in Data:
        if i not in stopWords:
            print(i)
            wordlist.append(i)
    wordlist = ''.join(wordlist)
    wordList = "/".join(jieba.cut(wordlist)) # 使用jieba进行切词，并且把每个词语使用/分隔开
    listOfTokens = wordList.split("/") # 
    x= [tok for tok in listOfTokens if (tok not in stopWords and tok in main_m)] # 注意python3 写成一行的if 语句需要用括号
    # x=list(set(x)) # 使用词集
    '''
    词集和词袋的区别：
    词集里面只考虑每个词是否出现
    词袋同时也会考虑每个词出现的次数
    
    '''
    results=('\t'.join(x))
    print(results)
    return results # return回来直接就是我们的好多个token
    # return results

def prefix_match(word):
    if word == '':
        return []
    table = []
    # with codecs.open('../data/foodname_list.txt','r') as f:
    #     for line in f:
    #         line = line.strip().split('||')
    #         for i in line:
    #             print(line)
    #             table.append(line)
    #             break
    # print(table[1])
    # tables=['木耳炒鸡蛋','木耳深度放松的好','sdsdfsd']
    tables = ["番茄鸡蛋","番茄炒鸡蛋","番茄炒蛋","鱼香肉丝","京酱肉丝","西红柿鸡蛋","西红柿炒蛋","木耳炒蛋","木耳鸡蛋","木耳炒鸡蛋","8寸戚风蛋糕","DIY地三鲜","Q香弹牙的酱猪手","diy肯德基至Q虾球","hello kitty蛋糕","【原创首发】地三鲜","【原创首发】家常卤肉","【粉丝虾皮萝卜丝】","三味饺子","三杯凤爪","三杯鸡","三鲜韭菜合子","东北乱炖","东北土豆酱","东北地三鲜","东北地三鲜","东北地三鲜","东北地三鲜——家庭少油版","东北大拌菜","东北大炖菜","东北大碴粥","东北大碴粥","东北大锅烙","东北大锅烙","东北大饼子","东北干豆腐卷大葱","东北泡菜烤肉","东北溜肉段","东北炖--大杂烩","东北炸鸡蛋酱","东北烧茄子","东北熏卷煎","东北熏干豆腐肉卷","东北熘肥肠","东北疙瘩汤","东北疙瘩汤","东北芸豆馅","东北菜—溜肉段","东北菜乱炖","东北菜团子","东北菜团子","东北蘸酱菜","东北酸菜炖海蛎子","东北酸菜白肉血肠","东北酸菜粉","东北酸菜肉馅包子","东北酸菜饺子","东北锅包肉","东北饭包","东北鸡蛋酱","东北鸡蛋酱","东北鸡蛋酱","东北黄米饭","丝瓜浸鱼丸","中式毛毛虫热狗","中空版戚风蛋糕","丹东炒叉子","乡巴佬鹌鹑蛋","乳酪小蛋糕","五仁月饼","五仁炒饭","五光十色黄金卷","五彩大拌菜","五彩毛豆","五彩黑白菜","五色素馅饺子","五花肉炖四季豆","五谷豆浆-首发","五香花卷","五香草帽饼","五香酱黄豆","俄式红菜汤","免烤焦糖蛋奶布丁","全麦糖三角","全麦糖三角","全麦素包子","八珍炖乌鸡","兰花干子","关东煮","冒牌曲奇","农夫面包","冬日滋补羊肉汤","冬瓜木耳虾仁羹","冰爽捞汁菜","冰糖山楂羹","冰糖猪蹄","冰糖葫芦","冻豆腐焖菠菜","凉拌三色腐竹","凉拌东北大拉皮","凉拌水萝卜-首发","凉拌猪头肉","凉拌白菜蜇头","凉拌百叶","凉拌紫甘蓝","凉拌苦菊","凉拌菜","凉拌马兰头","凉拌黄豆芽","凉瓜牛秋鱼汤","减油版核桃酥","凤梨酥","凤爪花生煲","刺老芽摊鸡蛋","刺老芽炒鸡蛋","刺老芽炒鸡蛋","包菜炒西红柿","北方酥锅","南乳猪蹄","南瓜小面点","南瓜布丁","南瓜炖土豆","南瓜烧牛肉","南瓜玫瑰卷","南瓜红枣玉米面发糕","南瓜葱油饼","卤汁排骨","卤煮白芸豆","卤煮豆腐丝","卤猪肘","卤面条","卤鸭","压力锅酸菜排骨","原只南瓜蒸排骨","叉烧焖西葫芦","双色葱花卷","发面糖三角","可乐鸡块","可可纸杯蛋糕","台式绿豆碰","咖啡麦饼","咖喱牛腩","咖喱肉丸盖饭","咸蛋黄烧茄子","咸蛋黄薯泥开口酥","咸香第一素鱼段","哈密瓜雪梨煲猪腱","哈尔滨锅包肉","四叶菜汤","四色虾饺","回锅肉包子","回锅肉炒饭","回锅蛋","土豆丝饼","土豆干黄瓜钱炒肉","土豆汤","土豆炖大白菜","土豆炖牛肉","土豆炖茄子","土豆炖豆角","土豆炖豆角","土豆炖鸡块","土豆烧翅根","土豆片炖干豆腐","土豆玉米炖豆角","土豆白菜炖肉丸","土豆芸豆炖排骨","土豆西红柿疙瘩汤","土豆豆角炖粉条","地三鲜","地三鲜","地三鲜","地三鲜","地三鲜炖宽粉","地三鲜的做法（原创首发）","地瓜姜汤","坛肉","培根胡萝卜面包","基础辣椒酱","大丰收","大丰收","大头菜炖粉条","大枣玉米发糕","大理石奶油蛋糕","大白菜圆子","大白菜炖冻豆腐","大白菜炖粉条","大白菜炖粉条子","大白菜肉包子","大肉包菜水饺","大葱炒肉丝","大葱猪肉水饺","大骨头炖土豆","大骨炖玉米","大骨烩酸菜粉条","天使蛋糕卷","天妇罗饭团","天气凉了，吃一道炖菜吧——土豆炖豆角","头菜蒸仙骨鱼","奶油曲奇","奶酪焗西兰花","奶香刀切馒头","奶香玉米酪","嫩炸牛肉","嫩煎油甘鱼佐桔酱","孜然小土豆","孜然薯片","宫保杏鲍菇","宫保鸡丁披萨","宫爆河虾","宫爆虾仁","家常地三鲜","家常地三鲜","家常地三鲜","家常小滑肉","家常小花卷","家常扣肉","家常炒蚕蛹","家常炖海鱼","家常烧三道鳞","家常猪皮冻","家常葱油卷","家常锅包肉","家庭版三汁焖锅","家庭版宫保鸡丁","家炖大黄鱼","家炖小黄鱼","小刺猬豆沙包","小白菜炒黏蘑","小白菜烧肉丸子","小白菜猪肉水饺","小白菜猪肉馅儿大包子","小白菜肉馅包","小野鸡炖蘑菇","小鸡炖榛蘑","小鸡炖蘑菇","尖椒丝瓜条","尖椒干豆腐","尖椒炒肥肠","尖椒炒鸡心","尖椒鸡嗉子","山东大饼","山东开阳白菜","山寨京酱肉丝","山楂糖葫芦","川芎白芷鱼头汤","川菜——豆瓣鱼","巧克力草莓","巧克力酸奶核桃蛋糕","巧炒五香瓜子","巴蜀虾","干炒牛河","干炸小丸子","干炸小鱼","干煸五花肉芸豆","干煸蚕蛹","干豆腐卷大葱","干豆腐炖大白菜","干酱菜拌蒸排骨","平桥豆腐羹","广式腊肉","开心果柚子茶脆饼","彩纹芝士蛋糕","彩蔬鸡蛋炸酱面","得莫利炖鱼","微波炉蛋糕","快速制作冰激凌","意大利咖啡饼干","手指饼干","手撕蒜苗拌虾米","手撕饼——早餐好搭档","手擀面","手擀面","扎松肉","扑闪疙瘩","扒茄条","打饭包----东北平民美食","拌花菜","挂霜蚕蛹","排骨干豆角","排骨炖豆角","排骨炖豆角","排骨烧板栗","提子司康","收涎饼","新地三鲜","方便面蛋葱饼","无奶油芒果冰激凌","日式福袋小火锅","日式蒸烤乳酪蛋","日本棉花蛋糕","明太鱼炖豆腐","春节年味之财源广进","春饼","普罗旺斯蛋汤丸","朝族辣酱炒年糕","木瓜炖牛奶","木瓜牛奶炖雪蛤","木耳炒白菜","木耳炒腐竹","木耳炒鸡蛋","木耳韭菜煎饺","木须肉","木须肉","机器猫的铜锣烧~","杀生鱼——一鱼两吃","杂粮夹馅发糕","杂蔬热汤面","李连贵熏肉大饼","杏仁奶糊","杏仁曲奇","杏子果酱","杏鲍菇猪肉饺子","松仁玉米","松化的华夫饼","枣泥馅","枣馒头","柠檬蜂蜜玛芬","柠香叉烧鸡","柠香红豆沙","柱侯酱薯仔焖鸡","柿子松糕","栗子烧鸡","栗子焖老鸡","核桃脆饼","桂花酒酿苹果羹","桑葚幕丝蛋糕","桔皮酱","椒盐敲扁迷你土豆","椒香肉丝","椰丝燕麦球","椰奶冻糕","椰子奶油球","椰汁红豆糕","椰汁雪花糕","椰香糯米糍","榄菜肉松炒四季豆","榆钱窝窝头","榛蘑炖鸡翅","樱桃小丸子蛋糕","橄榄火腿菜包饭","欧式脆皮小小蛋糕","正宗东北酸菜大饺子","水晶果冻蛋糕","水晶白菜造型虾饺","水果奶酪蛋糕","水煮鱿鱼","水煮麻辣鱼","水芹菜炒腊肉","氽白肉","汆白肉","沙茶蟹子粉丝煲","没有豆面的驴打滚","油泼双笋","油渣夹馍","油焖尖椒炒鱿鱼须","油焖豆角","油爆大虾","油爆虾 ","油豆角炖土豆","泡椒凤爪","泡椒杏鲍菇","泡椒爆猪肝","泡椒牛肉丝","泡椒田鸡","洋葱火腿饼","洋葱炒云耳","洋葱牛肉蒸饺","洋葱鸡肉馅饼","浇汁草鱼","海南白切鸡","海苔肉松芝麻大饼","淡淡清香豌豆饭","清水煮青蟹-首发","清汤南瓜面疙瘩","清炒皮皮虾","清炒西兰花","清蒸左口鱼","清蒸茄子","清蒸鱼","清蒸鲅鱼干","清蒸黄骨鱼","清蒸黑头鱼","清香芒果鸡柳","湖南剁椒","湖南风味嗦螺","溜肉段","溜肉段","溜血豆腐","滋补猪骨手擀面","灌汤小笼包","火烧套餐--儿童营养","炒竹帘面","炒茄子土豆","炖地三鲜","炖排骨","炖芸豆土豆肉片","炖酸菜","炝拌干丝","炝拌腐竹花生米","炝拌金针菇干豆腐丝","炝拌青虾","炝绿豆芽","炝酸辣土豆丝","炸酱面","炸香椿鱼儿、凉拌香椿","烂糊白菜","烤牛肉丸","烤鸡翅","烧烩冻豆腐","烧肉","烧茄子","烧饼夹肉","烩凤爪","烩酸菜粉","烫面豆沙饼","焗意粉","煎粘豆包","煎黄鱼","照烧牛肉饭","照烧酱烤排骨","煸油豆角","熘素肉段","熬炒鸡","燕窝椰奶西米露","爆炒猪肝","爆炒辣子鸡","爆炒青椒墨鱼仔","牛奶雪花糕","牛窝番茄汤","牛肉丸子萝卜汤","牛肉炖白萝卜","牛肉芹菜炒饭","牛肉茼蒿粗粮包","牛髓鲜蔬汤","猪耳朵豆角炒牛肉","猪肉土豆炖豆腐","猪肉土豆烧豆角","猪肉干豆角包子","猪肉洋葱炒平菇","猪肉炖粉条","猪肉炖豆角","猪肉白菜炖冻豆腐","猪肉白菜炖粉条","猪肉白菜炖粉条","猪肉白菜炖粉条","猪肉白菜炖粉条","猪肉白菜烧豆腐","猪肉粉条炖金针菇","猪肉芹菜水饺","猪肉茴香水饺","猪肉茴香饺子","猪肉萝卜炖粉条","猪肉萝卜炖粉条","猪肉豆腐卷","猪肉酸菜炖粉条","猪肉酸菜炖粉条","猪脚面线","猪蹄花卷","猪骨头烩酸菜","猫耳面【原创首发】","玉米大渣子红豆饭","玉米羹","玉米面蛋糕","玉米面贴饼子","瑞士鸡冀","瓜子酥","瓜片木耳干豆腐炒肉","甘露酥","甜蜜冰糖藕","甜香玉米烙","生炒蟛蜞","生菜丝鸡蛋炒饭","田园沙拉","电锅手撕鸡","电锅炖鸡汤","电饭锅做酸奶","电饭锅咸香鸡","电饼铛豆沙酥饼","番茄带鱼","番茄烘鸡蛋","番茄牛肉鸡蛋面","番茄牛腩","番茄酱牛肉面","番茄里脊","番茄鸡蛋捞面","番茄鸡蛋疙瘩汤","白糖烧饼","白菜五花肉炖豆腐","白菜火腿豆渣卷","白菜炖冻豆腐","白菜炖冻豆腐","白菜炖凤爪","白菜炖土豆","白菜炖土豆","白菜炖小豆腐","白菜炖番茄","白菜炖粉条","白菜炖粉条","白菜炖粉条","白菜炖裙边","白菜炖豆泡","白菜炖豆腐","白菜炖豆腐","白菜炖鱼丸粉丝","白菜炖鸡","白菜烩脆皮豆腐","白菜猪肉包子","白菜猪肉炖粉皮","白菜粉丝丸子","白菜粉丝炖豆腐","白菜粉条炖大肠","白菜粉条烩排骨","白菜粉条肉","白菜粉皮炖腊肉","白菜粉皮炖鸡","白菜素肉丸","白菜腐竹煮粉丝","白菜芹菜猪肉蒸包","白菜芹菜肉包子","白菜蒸饺","白菜豆腐","白菜豆腐汤","白菜豆腐泡","白菜豆腐炖粉条","白菜豆腐炖粉条","白菜豆腐酱汤","白萝卜猪肉包子","百香果芝士蛋糕","皮蛋豆腐","皮蛋香葱拌豆腐","盐焗鸡","盐酥腰果","砂锅豆腐酱汤","私家冷面","私家韭菜盒","积酸菜","简易酱肉","简简单单的凉瓜炒蛋","粉条炒肉","粟米百合炒西芹","精肉炒黄瓜干","糖醋白菜","糖醋笨蛋","糖醋鱼块","糯米丸子","糯米红枣","糯米藕","素卤咸豆花","素四鲜锅贴","素回锅肉","素炒三丝","素炒三丝","素炒茄丝","素炒虾仁","素烧饼","素菜也美味【西红柿烧茄子】","素锅包肉","素饺子面","素鸡炒白菜","紫芸豆炖粉条","紫薯包","紫薯糯米糊糊","紫薯雪梨果","紫薯面包花儿","红枣夹心糯米糕","红枣如意卷","红烧兔肉","红烧土豆块","红烧大棒骨腐竹","红烧排骨炖玉米","红烧肉炖豆角","红烧肉豆腐扣","红烧青鱼","红烧鲅鱼土豆块","红烧鸡中翅","红糖馅饼","红豆包","绿豆粉皮拌黄瓜","绿豆饼的做法","罗汉果茶","美味土豆饼","美味腌辣椒","美味豆腐煎","美食小南瓜","老板鱼炖萝卜丝","耗油蒜薹","肉丝炒五彩","肉丝白菜熬豆腐","肉丝笋片","肉丝藕条","肉块炖茄子干","肉夹馍","肉末扒茄子","肉末酱茄子","肉末鸡蛋羹","肉松饭团","肉沫炸酱面","肉炒大头菜","肉炒茄子丝","肉炒茼蒿","肉炒萝卜丝","肉片炒莴苣","肉片炒菜花","肉片炒豇豆","胡萝卜羊肉饺子","胡萝卜蛋羹","脊骨炖土豆","脊骨炖酸菜","脊骨酸菜炖粉条","腊肉虾仁白萝卜","腊肠炒黄瓜","腊肠烤饼","腌柠檬片","腌蒜茄子","腌鱼","臊子面","自制冷面","自制松仁小肚","自制牛肉干","自制美味牛肉干","自制蘿蔔糕","自制豆腐","自制辣白菜","自制麻辣香肠","芒果乳酪蛋糕","芒果冰淇淋","芒果牛奶西米露","芒果芝士蛋糕","芝士培根焗薯蓉","芝士肉酱意粉","芝麻南瓜饼","芝麻大饼","芝麻杂粮面包卷","芝麻酱红糖薄脆饼","芝麻香糕","芥菜疙瘩炒肉丝","芭菲","花生腐乳焖排骨","花生酱酥饼","花生酱面包","花生鱼蓉粥","芹菜叶土豆酱","芹菜炒五花肉","芹菜炒牛柳","芹菜煎豆渣","芹菜猪肉盒子","芹菜粉","芹菜素鸡","苏子籽儿烤饼","苏子籽儿糖馅饼","苔菜炒肉","苔菜炖粉条","苦瓜焖叉尾","苦菊凉拌鱼皮","茄丁小炒","茄子土豆疙瘩汤","茄子土豆酱","茄子土豆酱——东北菜","茄子炖土豆","茄子炖土豆","茄汁黄金虾","茄泥猪尾骨","茄镶肉","茉莉酸梅茶","茧蛹炒大葱","茴香肉火烧","茴香馅饺子","茶树菇炖小鸡","草莓玛格丽特馅饼","荠荠菜炖土豆-东北炖","荠菜鲜虾馄饨","荷兰豆炒腊肉","莲蓉卷","莴笋炒酱肉","菊花糕","菜卷子","菜名","菜炒南瓜螺旋面","菜花炒腊肉","菠菜鱼丸疙瘩汤","菠萝炒饭","萝卜丸子","萝卜炖鸭块","萝卜猪手汤","萝卜豆渣丸子","萝卜馅水饺","营养早餐之葱香蛋夹饼","营养白菜卷","葡萄干奶酪面包","葡萄干戚风","葡萄干面包","葱花烙饼","蒜子焖叉尾","蒜泥拌肉","蒜泥白肉","蒜泥血肠","蒜泥黄瓜","蒜炒拍黄瓜","蒜瓣烧茄子","蒜苔炒肉片","蒜苔炒鸡蛋","蒜茄子","蒜茄子","蒜蓉油麦菜","蒜蓉芝麻酱拌苦菊","蒜蓉茄夹","蒜蓉黑白菜","蒜香回锅肉","蒜香土豆丝","蒜香木须柿子","蒜香油麦菜","蒜香烧烤酱版叉烧肉","蒜香角瓜炒鸡蛋","蒸肉","蒸菜—蒸蒸日上","蒸萝卜干咸菜","蒸萝卜干咸菜","蓑衣黄瓜","蓝莓酸奶冰激凌","蔬菜浓汤","蔬菜炖粉条-首发","蔬菜肉丁面","蔬豆卷","薯香蛋饼","藕粉桂糖糕","蘑菇炖鸡","蘑菇炖鸡块","虾仁鸡肉卷","虾皮土豆片","虾皮烧冬瓜","蚕豆米炒鸡蛋","蚝油排骨","蚝油蒜蓉油麦菜","蚝油豆角烧土豆","蛋塔","蜂蜜抹茶蛋糕","蜜汁干煸牛肉","蜜烤叉烧肉","蜜豆馒头","螃蟹白菜粉丝煲","西兰花炒肉","西班牙米饭","西红柿炒卷心菜","西红柿炒土豆片","西红柿炒大头菜","西红柿炒菜花","西红柿炒蛋-首发","西红柿鸡蛋南瓜面片汤","西芹炒猪腰","西芹炒蘑菇","西芹百合炒腰果","西芹腰果","西西里冰淇淋","角瓜丝炒肉丝","角瓜虾米蛋馅饺子","详细步骤——东北酸菜馅饺子","谷小饼","豆干炒青豆","豆干肉丁炒毛豆","豆沙夹心冰糖葫芦","豆沙枧水粽","豆沙馅餐包","豆渣葱花饼","豆瓣酱茄子","豆腐卤","豆花肉片","豆芽粉条","豆角丝炒肉","豆角土豆炖骨头","豆角地瓜炖排骨","豆角炖面瓜","豆角炖骨头","豆角烧肉","豆角烩饼","豆角焖蔬菜面","豆角玉米面包子","豆角素焖面","豆豉蒸排骨","豆饭玉米碴子粥","豉椒鸡块","豉油鸡","豉香地三鲜","贵州白酸汤","软底鸡瓜","软炸茄条","软炸茄盒","软炸里脊","软炸里脊","轻奶酪蛋糕","辣味莴笋-首发","辣子鸡块","辣椒炒鱼饼","辣炒花蚬子","辣白菜炒五花肉","过油肉土豆片","连汤肉片","酒香腊肠手撕包菜","酥炸带鱼","酥羊肉","酱大骨","酱大骨头","酱小土豆","酱排骨边","酱汁鸡腿与鸡翅","酱炒蛋","酱炒豇豆肉丝","酱炖芸豆","酱炖豆腐","酱烧茄子","酱焖小土豆","酱焖豆角土豆","酱爆火腿鲍菇","酱茄子","酱茄子","酱香凤爪","酱香肉末茄子墩","酱骨头","酱黄瓜","酸奶冰淇淋","酸梅酱","酸汤猪脚","酸甜排骨","酸甜排骨","酸甜锅包肉","酸菜丝炒肉丝","酸菜多层饼","酸菜氽白肉","酸菜汆白肉","酸菜汆白肉","酸菜炒肉丝","酸菜炖排骨","酸菜炖排骨","酸菜炖肉","酸菜猪肉蒸饺","酸菜猪肉馅饺子","酸菜猪肉馅饼","酸菜白肉","酸菜白肉","酸菜白肉","酸菜白肉炖粉条","酸菜白肉血肠","酸菜白肉血肠","酸菜白肉锅","酸菜粉","酸菜粉条汆白肉","酸菜肉包子","酸菜脊骨炖冻豆腐","酸辣黑白菜","醉河蟹","醋烹带鱼","金牌土豆泥沙拉","金菇羊肉片","金针牛肉焖伊面","金银卷","金鸽报喜之虫草花鲜蚝鸽子汤","针菇伴干丝","针菇拌干丝","银鳕鱼西兰花沙拉","锅包肉","锅包肉","锅包肉","锅包肉","锅包肉","陈皮红豆沙","陈醋菠菜","随便小炒","雪绵豆沙","雪蛤炖蛋奶","雪里红炖土豆","雪里蕻炖豆腐","青椒土豆丝","青椒土豆丝","青椒土豆炒肉片","青椒土豆片","青椒揣肉","青椒炒土豆片","青椒炒鱿鱼丝","青椒肉沫烧茄子","青椒腊味肠","青瓜肉片","青菜拌木耳","青豆玉米小炒","青鱼炖菜","面筋泡塞肉","面茄子","韩式泡菜饺子","韭菜猪肉三鲜馅饼","韭菜猪肉锅贴","韭菜盒子","韭菜花炒腊肉","韭菜鱼肉馅饺子","韭菜鸡蛋小银鱼","韭菜鸡蛋锅贴","韭菜鸡蛋馅饼","顺德酿豆角","风味炒年糕","飞饼葡式蛋塔","饺子","香椿芽拌豆腐","香浓芒果沙冰","香炒蚕蛹","香炸茄盒","香炸茄盒","香炸鸡柳","香烤五花肉","香煎刀鱼","香煎柠檬鸡柳","香煎水饺","香甜提子布丁","香甜米酒","香甜鱿鱼丝","香糯青椒炒土豆片","香肉焖笋","香脆金黄冬粉春卷","香草叉烧","香草可乐鸡翅根","香草肉松蛋糕","香菇干豆腐","香菇油菜猪肉水饺","香菇炖豆角","香菇鸡肉粥","香菇鸡蛋炒饭","香菜丸子豆腐汤","香菜煎饼","香菜猪肉饺子","香葱海苔苏打饼","香葱蒸梭子蟹酱","香葱鸡蛋小辣椒","香辣孜然牛肉片","香辣小海虾","香辣榨菜丝","香辣疙瘩丝咸菜","香辣芥菜头","香酥腰果","香酥花生","香酥花生米","香酥茄盒","香酥薄肉饼","香酥藕夹","香醋裙带菜-首发","香香蜂蜜麻花","骨汤拉面","高压红烧肉","高汤猪脆骨炖酸菜","高粮老面馒头","鱼头泡饼","鱼头粉","鱼肉馅饼","鱼香汁","鲅鱼馅饺子","鲔鱼色拉煎饼","鲜橙果冻","鲜烧豆腐","鲜玉米粥","鲜腐竹蛋汤","鲜菇鸡片","鲜蚕豆火腿焖饭","鸡块炖土豆宽粉","鸡心烧豆角","鸡汁鲍鱼","鸡汤豆腐串","鸡翅根烧豆腐","鸡肉卷","鸡肉土豆炖蘑菇","鸡肉大馅饼","鸡肉片炒青椒土豆片","鸡肉蘑菇炖饭","鸡腿炖蘑菇","鸡蛋溜豆腐","鸡蛋灌饼","鸡蛋韭菜馅锅贴","鸭油千层酥月饼","麦香馒头","麻叶","麻辣冻豆腐","麻辣卤兔排","麻辣卤兔排","麻辣水萝卜-首发","麻辣肉丝面","麻辣脆豆角","麻辣鸡脖","麻辣鸡脖子","麻辣鸡腿","麻酱卷子","麻酱小拌菜","麻酱莴笋苗-首发","麻酱豇豆","黄瓜拌拉皮","黄瓜虾米素馅饺子","黄瓜钱炒土豆干","黄瓜鸡蛋馅水饺","黄米面锦绣豆包","黄米饼","黄芪红枣茶","黄花菜炒大白菜","黄菇土豆烧鸡块","黄豆酱蒸鱼","黄豆面条","黄金南瓜肉卷","黄金鸡蛋卷","黄面素包子","黄面馒头","黑加仑土司","黑椒牛扒","黑椒西芹牛肉粒","黑胡椒串烤鸡翅","黑芝麻开口笑","黑芝麻饼干","黑豆芽炒腊肉"]
    out = []
    # print('sdfsd',word)
    # print(tables[0])
    for t in tables:
        if t.startswith(word) or word in t:
            out.append(t)

    return out

def part_match(query): # 先做前缀匹配，在前缀匹配的结果里面，一个个进行包含关系的配对就好了。
    word = word_seg(query.strip()) # 返回的是一个个的词语，先用第一个进行前缀匹配
    # print('len', len(word),word)
    candidates = prefix_match(word.strip().split("\t")[0])
    # print('sdfsdsdfsdfsd',candidates) # 所有的候选集合
    if candidates == []:
        return 0
    if len(word.strip().split("\t"))>1:
        print('候选结果有', candidates)
        for i in word.strip().split("\t")[1:]:
            for j in candidates:
                if i in j:
                    return j # 某个菜的名字
    else:
        print('候选结果',candidates[0]) # 会出现一个候选结果
        return candidates[0]

def edit_distance(str1, str2):
    len1 = len(str1)
    len2 = len(str2)
    m = []
    for i in range(0, len1+1):
        tmp_zeros = [0 for i in range(0, len2 + 1)]
        m.append(tmp_zeros)
    for i in range(0, len1+1):
        m[i][0] = i
    for j in range(0, len2+1):
        m[0][j] = j
    for i in range(1, len1+1):
        for j in range(1, len2+1):
            tmp = 0 if str1[i-1] == str2[j-1] else 1
            m[i][j] = min(m[i-1][j-1] + tmp,
                          m[i - 1][j] + 1,
                          m[i][j - 1] + 1)
    return m[len1][len2]

def part_match2(query): # 先做前缀匹配，在前缀匹配的结果里面，一个个进行包含关系的配对就好了。
    candidates = prefix_match(query)
    print('前缀',candidates)
    # print('sdfsdsdfsdfsd',candidates) # 所有的候选集合
    if candidates == []:
        word = word_seg(query) # 返回的是一个个的词语，先用第一个进行前缀匹配
        print('len', len(word),word)
        candidates = prefix_match(word.strip().split("\t")[0])
        print('sdfsdsdfsdfsd',candidates) # 所有的候选集合
        if candidates == []:
            return 0
        if len(word.strip().split("\t"))>1:
            print('候选结果有', candidates)
            t_str = candidates[0]
            t_score = -edit_distance(query, t_str)
            for j in candidates:
                # tt_score = get_sim_feature(query, j)
                tt_score = -edit_distance(query, j)
                print(tt_score)
                if tt_score > t_score:
                    t_str = j
            return t_str
                    # if i in j:
                    #     return j # 某个菜的名字
        else:
            print('候选结果',candidates[0]) # 会出现一个候选结果
            return candidates[0]
    else:
        print('候选结果sdf',candidates[0]) # 会出现一个候选结果
        return candidates[0]

def get_sim_feature(s1, s2):
    return WmdUtil.get_sims(s1.strip(), s2.strip())


def query_search(query):
    if query in menu:
        print('\t'.join(menu[query]))
        print('1')
        return '\t'.join(menu[query])
    elif part_match2(query) != 0:
        tmp = part_match2(query)
        print(tmp)
        print('type and answer',type(tmp))
        print('\t'.join(menu[tmp]))
        print('2')
        return '\t'.join(menu[tmp]) 
    else:
        print('亲爱的同学，你请求的菜品我们暂时还没有收录，敬请期待，谢谢   ')
        print('3')
        return '亲ai的同学，你请求的菜品我们暂时还没有收录，敬请期待，谢谢'
query_test = sys.argv[1]
if __name__ == '__main__':
    line = query_test
    x = query_search(line)
    print(x)
